# Absorptance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThermalProperties..::..Absorptance Property
ThermalProperties Class See Also
---
Value of absorptance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Absorptance { get; set; }
```

Visual Basic
---
```text
Public Property Absorptance As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Absorptance {
	double get ();
	void set (double value);
}
```

# See Also
ThermalProperties Class
Autodesk.Revit.DB Namespace